Revit 2027 API
IFCPropertyMappingInfo.IsValidMappingInfo Method
 Defines whether the mapping info contains meaningful data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidMappingInfo(
	IFCPropertyMappingInfo mappingInfo
)
Public Shared Function IsValidMappingInfo (
	mappingInfo As IFCPropertyMappingInfo
) As Boolean
public:
static bool IsValidMappingInfo(
	IFCPropertyMappingInfo^ mappingInfo
)
static member IsValidMappingInfo :
        mappingInfo : IFCPropertyMappingInfo -> bool
Parameters
mappingInfo IFCPropertyMappingInfo
 The mapping info
Return Value
Boolean
 Whether or not the mapping info is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCPropertyMappingInfo Class
Autodesk.Revit.DB Namespace